//来自 https/emojixd.com/group/smileys-emotion
// export let emojiMap={
//   //笑脸表情
//   0:"😀", //嘿嘿
//   1:"😃", //哈哈
//   3:"😄", //大笑
//   4:"😁", //嘻嘻
//   5:"😆", //斜眼笑
//   6:"😅", //苦笑
//   7:"🤣", //笑得满地打滚
//   8:"😂", //笑哭了
//   9:"🙂", //呵呵
//   10:"🙃", //倒脸
//   11:"😉", //眨眼
//   12:"😊", //羞涩微笑
//   13:"😇", //微笑天使

//   //爱慕表情
//   14:"🥰", //喜笑颜开
//   15:"😍", //花痴
//   16:"🤩", //好崇拜哦
//   17:"😘", //飞吻
//   18:"😗", //亲亲
//   19:"☺️",  //微笑
//   20:"😚", //羞涩亲亲
//   21:"😙", //微笑亲亲

//   //吐舌表情
//   22:"😋", //好吃
//   23:"😛", //吐舌
//   24:"😜", //单眼吐舌
//   25:"🤪", //滑稽
//   26:"😝", //眯眼吐舌
//   27:"🤑", //发财

//   //手 + 脸
//   28:"🤗", //抱抱
//   29:"🤭", //不说
//   30:"🤫", //安静的脸
//   31:"🤔", //想一想

//   //中性或怀疑表情
//   32:"🤐", //闭嘴
//   33:"🤨", //挑眉
//   34:"😐", //冷漠
//   35:"😑", //无语
//   36:"😶", //沉默
//   37:"😏", //得意
//   38:"😒", //不高兴
//   39:"🙄", //翻白眼
//   40:"😬", //龇牙咧嘴
//   41:"😬", //说谎

//   //困倦表情
//   42:"😌", //松了口气
//   43:"😔", //沉思
//   44:"😪", //困
//   45:"🤤", //流口水
//   46:"😴", //睡着了

//   //不适表情
//   47:"😷", //感冒
//   48:"🤒", //发烧
//   49:"🤕", //受伤
//   50:"🤢", //恶心
//   51:"🤮", //呕吐
//   52:"🤧", //打喷嚏
//   53:"🥵",   //脸发烧
//   54:"🥶",   //冷脸
//   55:"🥴",   //头昏眼花
//   56:"😵",  //晕头转向
//   57:"🤯",  //爆炸头

//   //带帽表情
//   58:"🤠",  //牛仔帽脸
//   59:"🥳",    //聚会笑脸

//   //眼镜表情
//   60:"😎", //墨镜笑脸
//   61:"🤓", //书呆子脸
//   62:"🧐", //带单片眼镜的脸

//   //担心表情
//   63:"😕", //困扰
//   64:"😟", //担心
//   65:"🙁", //微微不满
//   66:"☹️", //不满
//   67:"😮", //吃惊
//   68:"😯", //缄默
//   69:"😲", //震惊 
//   70:"😳", //脸红
//   71:"🥺",   //恳求的脸
//   72:"😦", //啊
//   73:"😧", //极度痛苦
//   74:"😨", //害怕
//   75:"😰", //冷汗
//   76:"😥", //失望但如释重负
//   77:"😢", //哭
//   78:"😭", //放声大哭
//   79:"😱", //吓死了
//   80:"😖", //困惑
//   81:"😣", //痛苦
//   82:"😞", //失望
//   83:"😓", //汗
//   84:"😩", //累死了
//   85:"😫", //累
//   86:"🥱",   //打哈欠

//   //负面表情
//   87:"😤", //傲慢
//   88:"😡", //怒火中烧
//   89:"😠", //生气
//   90:"🤬", //嘴上有符号的脸
//   91:"😈", //恶魔微笑
//   92:"👿", //生气的恶魔
//   93:"💀", //头骨
//   94:"☠️", //骷髅

//   //搞怪表情
//   96:"💩", //大便
//   97:"🤡", //小丑脸
//   98:"👹", //食人魔
//   99:"👺", //小妖精
//   100:"👻", //鬼
//   101:"👽", //外星人
//   102:"👾", //外星怪物
//   103:"🤖", //机器人
// }

export let emojiMap = {
    '[微笑]': '/emoji/1.png',
    '[爱慕]': '/emoji/2.png',
    '[惊呆]': '/emoji/3.png',
    '[酷拽]': '/emoji/4.png',
    '[抠鼻]': '/emoji/5.png',
    '[流泪]': '/emoji/6.png',
    '[发怒]': '/emoji/7.png',
    '[呲牙]': '/emoji/8.png',
    '[鼾睡]': '/emoji/9.png',
    '[害羞]': '/emoji/10.png',
    '[可爱]': '/emoji/11.png',
    '[晕]': '/emoji/12.png',
    '[衰]': '/emoji/13.png',
    '[闭嘴]': '/emoji/14.png',
    '[机智]': '/emoji/15.png',
    '[求关注]': '/emoji/16.png',
    '[灵光一闪]': '/emoji/17.png',
    '[耶]': '/emoji/18.png',
    '[捂脸]': '/emoji/19.png',
    '[打脸]': '/emoji/20.png',
    '[大笑]': '/emoji/21.png',
    '[哈欠]': '/emoji/22.png',
    '[震惊]': '/emoji/23.png',
    '[送心]': '/emoji/24.png',
    '[困]': '/emoji/25.png',
    '[为啥]': '/emoji/26.png',
    '[泣不成声]': '/emoji/27.png',
    '[小鼓掌]': '/emoji/28.png',
    '[酷]': '/emoji/29.png',
    '[偷笑]': '/emoji/30.png',
    '[石化]': '/emoji/31.png',
    '[思考]': '/emoji/32.png',
    '[吐血]': '/emoji/33.png',
    '[可怜]': '/emoji/34.png',
    '[嘘]': '/emoji/35.png',
    '[撇嘴]': '/emoji/36.png',
    '[黑线]': '/emoji/37.png',
    '[笑哭]': '/emoji/38.png',
    '[雾霾]': '/emoji/39.png',
    '[奸笑]': '/emoji/40.png',
    '[得意]': '/emoji/41.png',
    '[憨笑]': '/emoji/42.png',
    '[抓狂]': '/emoji/43.png',
    '[泪奔]': '/emoji/44.png',
    '[钱]': '/emoji/45.png',
    '[吻]': '/emoji/46.png',
    '[恐惧]': '/emoji/47.png',
    '[笑]': '/emoji/48.png',
    '[快哭了]': '/emoji/49.png',
    '[翻白眼]': '/emoji/50.png',
    '[互粉]': '/emoji/51.png',
    '[赞]': '/emoji/52.png',
    '[鼓掌]': '/emoji/53.png',
    '[谢谢]': '/emoji/54.png',
    '[亲亲]': '/emoji/55.png',
    '[去污粉]': '/emoji/56.png',
    '[棒呆]': '/emoji/57.png',
    '[玫瑰]': '/emoji/58.png',
    '[胡瓜]': '/emoji/59.png',
    '[啤酒]': '/emoji/60.png',
    '[我想静静]': '/emoji/61.png',
    '[委屈]': '/emoji/62.png',
    '[舔屏]': '/emoji/63.png',
    '[鄙视]': '/emoji/64.png',
    '[飞吻]': '/emoji/65.png',
    '[再见]': '/emoji/66.png',
    '[紫薇别走]': '/emoji/67.png',
    '[听歌]': '/emoji/68.png',
    '[求抱抱]': '/emoji/69.png',
    '[凝视]': '/emoji/70.png',
    '[无辜笑]': '/emoji/71.png',
    '[吐舌]': '/emoji/72.png',
    '[呆无辜]': '/emoji/73.png',
    '[看]': '/emoji/74.png',
    '[白眼]': '/emoji/75.png',
    '[熊吉]': '/emoji/76.png',
    '[骷髅]': '/emoji/77.png',
    '[黑脸]': '/emoji/78.png',
}

//比如对: 一篇文章[黑脸]一篇文章[骷髅]一篇文章[熊吉]一篇文章
export function parseEmoji(article) {
    let reg = /\[[^\x00-\xff]+\]/g;
    //这里返回的ret对象包含index(匹配到的项的第一个字符的索引) ret[0]为匹配到的内容
    let ret = reg.exec(article);
    //匹配到的项
    let list_parse_emoji = []
        //每调用一次reg.exex只能获取到一个匹配项 再一次调用才能获取到下一个匹配项
    while (ret != null) {
        let emoji_name = ret[0]
        if (emojiMap.hasOwnProperty(emoji_name)) {
            list_parse_emoji.push(ret)
        }
        ret = reg.exec(article);
    }
    //返回值
    let list_ret = [];
    //如果一个都没匹配到,直接加一个type返回
    if (list_parse_emoji.length == 0) {
        list_ret.push({
            'type': 'text',
            'content': article
        })
        return list_ret;
    } else {
        //匹配到项前面的普通文本的第一个字符的索引 如"一篇文章[xx]" lastIndex指的是"一"的索引
        let last_index = 0;
        //对匹配到的每一项
        for (let i = 0; i < list_parse_emoji.length; i++) {
            //以空间换时间
            let ret = list_parse_emoji[i];
            let str1 = article.substring(last_index, ret.index)
                //如果匹配项前面的字符串为空则该空字符串不加进返回值, 只把匹配项加进返回值 
                //如"[xx]一篇文章[vv]",[xx]前面的字符串为空,空字符串不加进返回值，当然，也可以加进返回值，渲染一个空字符串相当于没渲染
            if (str1 == '') {
                list_ret.push({
                    'type': 'emoji',
                    'content': emojiMap[ret[0]]
                })
            } else {
                //先添加匹配项前面的字符串
                list_ret.push({
                        'type': 'text',
                        'content': str1
                    })
                    //再添加匹配项
                list_ret.push({
                    'type': 'emoji',
                    'content': emojiMap[ret[0]]
                })
            }
            last_index = ret.index + ret[0].length;
        }
        let str2 = article.substring(last_index)
            //如果最后一个匹配项后面的字符串为空 则直接返回，空字符串不加进去
        if (str2.length == 0) {
            return list_ret
        } else {
            //否则把最后一个匹配项后面的字符串加进去再返回
            list_ret.push({
                'type': 'text',
                'content': str2
            })
            return list_ret
        }
    }
}